---
kind: enumMember
id: F:Autodesk.Revit.DB.WallKind.Unknown
enum: Autodesk.Revit.DB.WallKind
source: html/24ac7c1a-1dba-a5c1-fe13-e2a90e4b9488.htm
---
# Autodesk.Revit.DB.WallKind.Unknown

The basic type is not known.